cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71N19.svd
            <register>
               <name>DEVEPT</name>
               <description>Device Endpoint Register</description>
               <addressOffset>0x001C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>EPEN0</name>
                     <description>Endpoint 0 Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN1</name>
                     <description>Endpoint 1 Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN2</name>
                     <description>Endpoint 2 Enable</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN3</name>
                     <description>Endpoint 3 Enable</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN4</name>
                     <description>Endpoint 4 Enable</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN5</name>
                     <description>Endpoint 5 Enable</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN6</name>
                     <description>Endpoint 6 Enable</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN7</name>
                     <description>Endpoint 7 Enable</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN8</name>
                     <description>Endpoint 8 Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPEN9</name>
                     <description>Endpoint 9 Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST0</name>
                     <description>Endpoint 0 Reset</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST1</name>
                     <description>Endpoint 1 Reset</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST2</name>
                     <description>Endpoint 2 Reset</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST3</name>
                     <description>Endpoint 3 Reset</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST4</name>
                     <description>Endpoint 4 Reset</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST5</name>
                     <description>Endpoint 5 Reset</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST6</name>
                     <description>Endpoint 6 Reset</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST7</name>
                     <description>Endpoint 7 Reset</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST8</name>
                     <description>Endpoint 8 Reset</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPRST9</name>
                     <description>Endpoint 9 Reset</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>DEVFNUM</name>
               <description>Device Frame Number Register</description>
               <addressOffset>0x0020</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MFNUM</name>
                     <description>Micro Frame Number</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
                  <field>
                     <name>FNUM</name>
                     <description>Frame Number</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
                  <field>
                     <name>FNCERR</name>
                     <description>Frame Number CRC Error</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>DEVEPTCFG[%s]</name>
               <description>Device Endpoint Configuration Register (n = 0) 0</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>ALLOC</name>
                     <description>Endpoint Memory Allocate</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPBK</name>
                     <description>Endpoint Banks</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EPBKSelect</name>
                        <enumeratedValue>
                           <name>_1_BANK</name>
                           <description>Single-bank endpoint</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BANK</name>
                           <description>Double-bank endpoint</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BANK</name>
                           <description>Triple-bank endpoint</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EPSIZE</name>
                     <description>Endpoint Size</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>EPSIZESelect</name>
                        <enumeratedValue>
                           <name>_8_BYTE</name>
                           <description>8 bytes</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_16_BYTE</name>
                           <description>16 bytes</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_32_BYTE</name>
                           <description>32 bytes</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_64_BYTE</name>
                           <description>64 bytes</description>
                           <value>0x3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_128_BYTE</name>
                           <description>128 bytes</description>
                           <value>0x4</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_256_BYTE</name>
                           <description>256 bytes</description>
                           <value>0x5</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_512_BYTE</name>
                           <description>512 bytes</description>
                           <value>0x6</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1024_BYTE</name>
                           <description>1024 bytes</description>
                           <value>0x7</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>EPDIR</name>
                     <description>Endpoint Direction</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>EPDIRSelect</name>
                        <enumeratedValue>
                           <name>OUT</name>
                           <description>The endpoint direction is OUT.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>IN</name>
                           <description>The endpoint direction is IN (nor for control endpoints).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTOSW</name>
                     <description>Automatic Switch</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>EPTYPE</name>
                     <description>Endpoint Type</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>EPTYPESelect</name>
                        <enumeratedValue>
                           <name>CTRL</name>
                           <description>Control</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ISO</name>
                           <description>Isochronous</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BLK</name>
                           <description>Bulk</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>INTRPT</name>
                           <description>Interrupt</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBTRANS</name>
                     <description>Number of transactions per microframe for isochronous endpoint</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBTRANSSelect</name>
                        <enumeratedValue>
                           <name>_0_TRANS</name>
                           <description>Reserved to endpoint that does not have the high-bandwidth isochronous capability.</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_TRANS</name>
                           <description>Default value: one transaction per microframe.</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_TRANS</name>
                           <description>Two transactions per microframe. This endpoint should be configured as double-bank.</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_TRANS</name>
                           <description>Three transactions per microframe. This endpoint should be configured as triple-bank.</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>10</dim>
               <dimIncrement>4</dimIncrement>
               <name>DEVEPTISR[%s]</name>
               <description>Device Endpoint Status Register (n = 0) 0</description>
               <addressOffset>0x130</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXINI</name>
                     <description>Transmitted IN Data Interrupt</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXOUTI</name>
                     <description>Received OUT Data Interrupt</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXSTPI</name>
                     <description>Received SETUP Interrupt</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKOUTI</name>
                     <description>NAKed OUT Interrupt</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NAKINI</name>
                     <description>NAKed IN Interrupt</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>OVERFI</name>
                     <description>Overflow Interrupt</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>STALLEDI</name>
                     <description>STALLed Interrupt</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SHORTPACKET</name>
                     <description>Short Packet Interrupt</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DTSEQ</name>
                     <description>Data Toggle Sequence</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DTSEQSelect</name>
                        <enumeratedValue>
                           <name>DATA0</name>
                           <description>Data0 toggle sequence</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA1</name>
                           <description>Data1 toggle sequence</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DATA2</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>MDATA</name>
                           <description>Reserved for high-bandwidth isochronous endpoint</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>NBUSYBK</name>
                     <description>Number of Busy Banks</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>NBUSYBKSelect</name>
                        <enumeratedValue>
                           <name>_0_BUSY</name>
                           <description>0 busy bank (all banks free)</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_1_BUSY</name>
                           <description>1 busy bank</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_2_BUSY</name>
                           <description>2 busy banks</description>
                           <value>0x2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>_3_BUSY</name>
                           <description>3 busy banks</description>
                           <value>0x3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CURRBK</name>
                     <description>Current Bank</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>CURRBKSelect</name>
                        <enumeratedValue>
                           <name>BANK0</name>
                           <description>Current bank is bank0</description>
                           <value>0x0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK1</name>
                           <description>Current bank is bank1</description>
                           <value>0x1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>BANK2</name>
                           <description>Current bank is bank2</description>
                           <value>0x2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RWALL</name>
                     <description>Read/Write Allowed</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CTRLDIR</name>
                     <description>Control Direction</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CFGOK</name>
                     <description>Configuration OK Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>BYCT</name>
                     <description>Byte Count</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>11</bitWidth>
                  </field>
               </fields>
            </register>
